Revit 2026 API

# PlasticvinylType Enumeration

---

The enumerated type representing the permitted values for the asset property "PlasticvinylType" from the "PlasticVinyl" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PlasticvinylType
```
```vb
Public Enumeration PlasticvinylType
```
```cpp
public enum class PlasticvinylType
```
```fsharp
type PlasticvinylType
```

| Member name | Value | Description |
| --- | --- | --- |
| Plasticsolid | 0 |  |
| Plastictransparent | 1 |  |
| Vinyl | 2 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace